const SCRIPT = [
  {
    type: "center",
    text: "20XX年\n「人工人間」実用化",
  },
  {
    type: "center",
    text: "アメリカにて、人間とほぼ同等の知能と外見を持つ存在――\n通称「人工人間」が開発された。",
  },
  {
    type: "center",
    text: "それは高度なAI技術とバイオ工学を組み合わせた、\n“新しい人材”とされている。",
  },
  {
    type: "center",
    text: "人手不足が深刻化する中、この技術は瞬く間に注目を集めた。",
  },
  {
    type: "center",
    text: "当初は非常に高価であり、一部の企業や富裕層に限られていたが、\n後に発表された「カード化技術」によって誰でも扱える形へと変化する。",
  },
  {
    type: "center",
    text: "専用のカードを用いることで、人工人間の呼び出し・回収・再利用が可能となった。",
  },
  {
    type: "center",
    text: "現在では、\n\n労働力として\nパートナーとして\nそして“気軽な存在”として\n\n広く社会に普及した――",
  },
  {
    type: "center",
    text: "コーポ・溝川 201号室",
  },
  {
    type: "dialogue",
    text: "矢野「ただいまー。はぁ、今日もバイト疲れた…モームリ」",
  },
  {
    type: "dialogue",
    text: "チャッピー「お帰りなさい、矢野サン。朝ご飯の支度が整いました。」",
  },
  {
    type: "dialogue",
    text: "矢野「あ…チャッピーさん。ありがとうございます…こんな僕のためにいつもすんません。」",
  },
  {
    type: "dialogue",
    text: "渡辺「『機械』相手に馬鹿馬鹿しいぞ！矢野！！こんなモノ…悪趣味な科学者共の産物でしか！ない！」",
  },
  {
    type: "dialogue",
    text: "矢野「酷いですよ、渡辺サン…そんな言い方しなくても…僕のなけなしのバイト代でようやく買えたんですから」",
  },
  {
    type: "dialogue",
    text: "渡辺「矢野！お前までこの汚い資本主義に毒されておるのか！日輪帝国男児として恥を知れ！！」",
  },
  {
    type: "center",
    text: "渡辺信之（36）\n矢野良一と居候中のニート。",
  },
  {
    type: "dialogue",
    text: "矢野「渡辺サンこそ…家賃と生活費、いつ返してくれるんですか」",
  },
  {
    type: "dialogue",
    text: "渡辺「元はというと！！あの愚かな『人工人間』なるモノが！我が仕事を奪った！望んで無職になっておらん！！」",
  },
  {
    type: "dialogue",
    text: "矢野「せめてバイトとか…探せばいいじゃないですか」",
  },
  {
    type: "dialogue",
    text: "渡辺「我には！それよりも重要な仕事がある！！この腐敗した日輪帝国を取り戻さねばならん！！」",
  },
  {
    type: "dialogue",
    text: "矢野「あーもうまた始まった…」",
  },
  {
    type: "dialogue",
    text: "渡辺「矢野！飯を食い終わったらコンビニに行け。酒とツマミが我々に必要だ。」",
  },
  {
    type: "dialogue",
    text: "矢野「ぼ、僕もうヘトヘトなんで自分で行ってきてくださいよ……」",
  },
  {
    type: "dialogue",
    text: "渡辺「我は今重要な計画を練っている！忙しいのだ！！常に！」",
  },
  {
    type: "dialogue",
    text: "矢野「そんなぁ…困りますよ渡辺サン。それにこないだの借金もまだ返してもらってないですよ！」",
  },
  {
    type: "dialogue",
    text: "渡辺「ToBeatの限定フィギュアが落札される」",
  },
  {
    type: "dialogue",
    text: "矢野「…はっ！そ、そ、それって！！まさかあの……！岬たんの！！？」",
  },
  {
    type: "dialogue",
    text: "渡辺「そうだ。昨日オークションがヤフ○クで開始されたぞ。」",
  },
  {
    type: "dialogue",
    text: "矢野「し、知ってますよそれくらい。けど、あの岬たん、もう最高額が10万円ですよ渡辺サン。僕にそんなお金ありませんって」",
  },
  {
    type: "dialogue",
    text: "渡辺「落札者は我が盟友だ。もう手配済なのだよ、矢野。」",
  },
  {
    type: "dialogue",
    text: "矢野「……マジすか渡辺サン。それって……僕のために……」",
  },
  {
    type: "dialogue",
    text: "渡辺「いや、違う。我も岬たん推しだ。譲るわけないだろう」",
  },
  {
    type: "dialogue",
    text: "矢野「で、ですよねぇ……」",
  },
  {
    type: "dialogue",
    text: "渡辺「だが！！今お前が！コンビニで酒とツマミを買ってきたら……その褒美をやらんこともないぞ」",
  },
  {
    type: "dialogue",
    text: "矢野「うわ、そういう魂胆か……いつもそうやって口車に乗せるのが上手いですよね、渡辺サンは。……うぅ、わかりましたよ。行ってきますよ。」",
  },
  {
    type: "center",
    text: "MISSION1：\nセブ○イレブンで酒とツマミを購入し、\n渡辺信之の元へ届けよ",
    isMission: true,
  },
];
